/*新知识点：
1.静态变量(两种访问方式)与动态变量(只能间接访问)；动态变量最大优点是可以释放(随用随弃)
动态变量=动态内存分配
2.变量的本质与三个属性参数（使用者，管理员CPU和厂商）
*/
#include<stdio.h>
#include<stdlib.h>

int main()
{
	int *p,a,i;
	int *h[2];
	int *q;
	//1-------静态变量直接访问：按变量名访问-------
	a=100;
	printf("%d\n",a);
	//2-------静态变量间接访问：通过指针来访问-------
	p=&a;
	*p=98;
	printf("%d\n",*p);
	//3-------动态变量访问：只能通过指针来访问-------
	p=(int *)malloc(sizeof(int));
	*p=999;
	printf("%d\n",*p);
	free(p);			//释放指针p所指向的动态内存
	//4-------多个动态变量访问：只能通过指针来访问-------
	q=p=(int *)malloc(sizeof(int)*4);   //本质是确定了一个一维数组
	*p=101;
	p++;
	*p=102;
	p++;
	*p=103;
	p++;
	*p=104;
	free(p);
	/*
	printf("%d  ",*p);
	p--;
	printf("%d  ",*p);
	p--;
	printf("%d  ",*p);
	p--;
	printf("%d  ",*p);
	free(p);
	*/
	//printf("\n");
	//超出范围是意外
	//p--;
	//printf("%d  ",*p);
	//free(p);			//在地址范围外使用free会出现编译出错
	//最合理可靠的方法是使用双指针

/*任务1：动态内存变量排序
1.对10个元素的整型动态数组中数据进行排序(升序)
2.数组中数据随机产生，范围为0-99

#include<stdio.h>
#include<stdlib.h>
#include<time.h>
srand((unsigned)time(NULL));
a=rand();

*/
	system("pause");
	return 0;
}

/*

	//5-------矩阵转置：将4x3的矩阵转置成3x4的矩阵-------
	//原矩阵值：1，2，3，4，5，6，7，8，9，10，11，12
	//转置后生成新矩阵为：1，4，7，10，2，5，8，11，3，6，9，12
	//1  2  3           1  4  7  10
	//4  5  6      -->  2  5  8  11
	//7  8  9           3  6  9  12
	//10 11 12

	//要求矩阵存储使用动态方式
	p=h[0]=(int *)malloc(sizeof(int)*12);
	q=h[1]=(int *)malloc(sizeof(int)*12);
	for(i=0;i<12;i++)
	{
		*p=i+1;
		p++;
	}
	for(i=0;i<12;i++)
	{
		printf("\t%d",*(h[0]+i));
		if((i+1)%3==0)
			printf("\n");
	}
*/